{
  "desert_camp":
  {
    "name": "desert camp",
    "song": "fugue_memories.mp3",
    "is_start": true,
    "is_current_location": true,
    "north": "path_1",
    "east": "desert_wilderness",
    "south": "desert_wilderness",
    "west": "desert_wilderness",
    "times_visited": 1,
    "was_forgotten": false,
    "long_description": "You awaken at an abandoned desert camp. Hot air stands stagnant around you, and the sun is bright in your eyes. As far as the eye can see there is the red horizon of a barren desert, air shimmering from the heat. To the north there is a walled city off in the distance. Beside you, a low fire is burning out. Behind you there is a ragged, knocked-over tent made of tattered green cloth, and a small brown leather satchel. There seems to be a path to a north, which must lead to the city. Beyond this camp appears to be nothing but wilderness. Standing ahead of you there is a shrouded stranger.",
    "short_description": "The desert camp has a low fire and a ragged tent. The path to the city lies to the north, beyond that is just wilderness. Nearby a shrouded man watches you. ",
    "forgotten_description": "You awaken to see a desert camp, long since abandoned. Beside you there are the remnants of a fire, a knocked over tent, and a small satchel. Standing nearby is a shrouded stranger. To the north seems to be a path of some kind, outside of that is just wilderness. It seems familiar somehow.",
    "ascii_art" : "              .  /  .\n            /*  ///  */\n             ///////\n          /**//,////,/**/\n        //,//,*//,,*//*//\n        ///,/,,*//,,,,/////\n        ///,/,,,/,,,,,,////\n         //,,,,,,,,,.,,,//\n    ..,**.*/,,..,. ,.,,,*.**,..\n   .*,%%%%%&&&&*.. ,&&&&%%%%%,*.\n,.*,,,%//#/..**&(/#&**,./#//%,,,,.*\n.,***,,,#&&&******,****&&&#,,****,.\n\n", 
    "features": 
    {
      "fire" : "The fire is smoldering, low embers whisping up into the air. Inside it there are some red-hot coals that once were logs.", 
      "tent" : "The tent is made of a ragged green cloth, once propped up by a dry branch. There isn't much left here. ",
      "satchel" : "The satchel itself is not very large, and it is made of a worn brown leather, with a long shoulder strap. Inside there is a wooden sword, like that a child would play with. There is also a cloth tunic, which may be able to protect you at least somewhat. Lastly, there is a small oil lamp that somehow has not gone out, despite seeming to be empty.",  
      "path" : "The shifting sands have been shuffled and settled to make this compacted trail. It leads north to the city.",
      "wilderness" : "The wilderness goes on as far as the eye can see, without a single speck of greenery or drop of water."
    },
    "npcs" : ["Impostor"], 
    "enemies" : [], 
    "items": ["Wooden Sword", "Cloth Armor", "Everburning Lamp"]
  },
  "desert_wilderness":
  {
    "name": "desert wilderness",
    "song" : "fugue_memories.mp3", 
    "is_start": false,
    "is_current_location": false,
    "north": "desert_camp",
    "east": null,
    "south": null,
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The desert wilderness is hot and sweltering, the air shimmering from the heat. The sand goes on for ages, with no end in sight, save for the camp to the north. A few small scrubby bushes eke out survival here, but there seems to be something moving in the distance.",
    "short_description": "The sandy desert wilderness goes on as far as the eye can see. Something rustles a dry bush in the distance. The camp lies back to the north.",
    "forgotten_description": "The desert wilderness is hot and sweltering, the air shimmering from the heat. The sand goes on for ages, with no end in sight. It seems familiar, in some way.",
    "ascii_art" : "\n                ()\n               *%(/\n            () *%(/\n            *) *%(/ ()  ()\n          /%)  %#%) (%  %&\n          (#   %#/ /%,  %&)\n           %&  %%#%#   #/,\n           %%(  %%/    %(,\n             %%%%%/   %(,\n                %%/ /%%\n                %%##                   (#\n                %%/                  * %#\n                %%/                  % %(\n      /%)       %#/                   %\n    ************%#/*******************%                           ******************\n    *******,**(#%%/*****************************************************************\n    ,*****,,,,,,,,,,,,,,,***********************,,,,,,,,,,,,***,,,,,,,,,,,,,,,,,,,,,\n    ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,\n\n", 
    "features": 
    {
      "bushes" : "The bushes are small and twiggy, and covered in thorns. They don't look like they would be good for much. ", 
      "thing" : "The movement in the distance suddenly gets closer and closer. You realize that you are being rushed by a wild hog! "
    }, 
    "npcs" : ["Impostor"], 
    "enemies": ["wild_hog"],
    "items": []
  },
  "path_1":
  {
    "name": "path 1",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "path_2",
    "east": null,
    "south": "desert_camp",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "Just outside the camp is a shifting, sandy road. Along the side of the road is a palm tree and some flowering cacti, whose blooms shine a bright reddish pink color in the moonlight.",
    "short_description": "There is a shifting sandy road, just outside the desert camp. You can smell the cacti blooms. ",
    "forgotten_description": "Just outside the desert camp is a familiar road, though it seems fairly untravelled. There's a palm tree on the side of the road, as well as a few cacti that are blooming bright reddish pink.",
    "ascii_art" : "\n                                    /////(\n                             //// //    //////(\n                           //(((((//////// ./////(          /////\n                            (((/////(   ((//*/////(    ////((((((((//\n                         ,//////////////// (//////( //((((   ///\n                              //////// ///// (///(/((, //////((/////\n                          ////////(((((((/////(//( //((*//////\n                         //((((              /////(((((((((/(((////,\n                        (                   **///      (((((////((((//\n                                          *//#//           /(((//// ((/\n                                         **///                (((///\n                                       **//#                   ((///\n                                       **///                   (//,\n                                      *///                     (/\n                                     ***//\n                                    **///.\n                                    ***//\n                                    **///\n                                   ***///\n                                   ***///\n                                   ****//\n                                   **////\n                                  *****//,\n                                   */////\n                                  *****///\n                         ,,,,,,,,,*//(/////,,,,,,,,*****\n                 ,,,,,,,,,,,,,,,,///***//##/,,,,,,,,,,*******\n             ,,,,,,,,,,,,,,,,,,,,,//,,,,,,,,,,,,,,,,,,,*********,***\n          ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,.\n                                       ,,,,,,,,,,,,,,,,,,\n\n", 
    "features": 
    {
      "palm tree" : "The palm tree leans and sways in the gentle breeze. From it hang a few coconuts.",
      "cactus" : "The cactus is covered in long spikes. It has a few sweet-smelling reddish-pink flowers that are blooming."
    }, 
    "npcs" : ["Impostor"], 
    "enemies" : [], 
    "items": []
  },
  "path_2":
  {
    "name": "path 2",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "path_3",
    "east": null,
    "south": "desert_camp",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The path is long and winds through the dunes. There isn't much but sand and open sky. To the south is the camp, and to the north lies the city. Along the side of the path lie some bones. ",
    "short_description": "The path is vacant, winding through the sandy dunes. To the south is the camp and to the north is the city.",
    "forgotten_description": "The sandy path winds through the dunes in a rhythm that seems familiar. To the north is the city, and to the south is the camp.",
    "ascii_art" : "\n       .                                               ..              .  .      \n    .....,//,       ........   .       ........   ./////// ....   . ,. //////    \n   ...////////// ........../////****.............////////////...******/////////  \n ,////(((((/////////,*////////*********////*,,///////,,**********,****//((///////\n /////(/*,*******,.,******,,,**************//((*,*******,***************,*/(((///\n *********,,*,***********,.,*****,,******,,********************,,,,,***,.,*******\n ,,************************************,,************,.,,**********************,,\n ********************************************************************************\n ********************************************************************************\n ********************************************************************************\n\n", 
    "features": 
    {
      "sky" : "Overhead you can see the sky is devoid of clouds. The sun is swelteringly hot.", 
      "bones" : "The bones look to be cow bones, old and sun bleached to a pure white. Looking closer, you see there is a snake, ready to strike. "
    }, 
    "npcs" : ["Impostor"], 
    "enemies" : ["snake"], 
    "items": []
  },
  "path_3":
  {
    "name": "path 3",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "city_gates",
    "east": null,
    "south": "path_2",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The sandy dunes gives way to sandstone, short scrubby bushes cling on for life in the cracks of the rock. In the distance you can see the city gates. Under your feet the path begins to turn to cobblestone, and alongside the path there is a small wooden sign. You can see strewn across the path are several shriveled flowers, bundled.",
    "short_description": "Scrubby bushes cling to the sandstone. In the distance, the city gates loom.",
    "forgotten_description": "The sandy dunes gives way to sandstone, short scrubby bushes cling on for life in the cracks of the rock. In the distance you can see the city gates. It feels like coming home.",
    "ascii_art" : "\n       /(((((((((.,\n    //(#(#%%%%%##((##%\n    ((#   %&@&&   #(#()\n    /##  %(%&&@#   %##\n     ##%%%%%&%%%%%%%(   .//**,\n        ###%%%%%%#      #(/((\n            %          #\n            %        #\n             #      (#\n     ..,*/(  %     (#\n         */(# #   /%\n         .*/(#%# /\n       ,,*,  ((.(.\n            /*(#(\n               (*\n               ,,\n               .,\n\n", 
    "features": 
    {
      "sign" : "The wooden sign is small and handmade. On it, painted in large letters reads:\nMONI KIVA -- 1 MILE NORTH\nKATOLISS -- 50 MILES SOUTH", 
      "flowers" : "The flowers are bunched in bouquets, with ribbons tied around them. They look to have been left behind after some kind of parade or event. Most of the flowers look to be poppies, tied with dark blue ribbon. "
    }, 
    "npcs" : ["Impostor"], 
    "enemies" : [],
    "items": []
  },
  "city_gates":
  {
    "name": "city gates",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "city_road_2",
    "east": null,
    "south": "path_3",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The city gates are tall, made from a similar sandstone to that beneath your feet. Pillars are carved intricately, supporting stacked bricks of sandstone and marble. Leaning against a pillar is a guard sleepily keeping watch.",
    "short_description": "The city gates are made of tall sandstone pillars. Leaning against the gates is a sleepy guard. ",
    "forgotten_description": "The city gates loom over you, the intricate pattern carved into the sandstone pillars sparks a memory in the back of your mind. The guard at the gate looks confused.",
    "ascii_art" : "\n    *********    ,,**,***%   ##(//***   ,******\n    ***************************,****,%%%****,,,\n    ,,****,,**********/////,,*%,,******,***,*,,\n    *****,,**%,,,#****%////***************,,,,,\n    **,#%%/***#(((((((#////(((((((,*********,*,\n    *******///(((#             ((((///*********\n    ***,##*((#%                   //((****,,,,,\n    ,,,,*%////                     *///%*******\n    *******((%                     (((**,,,,***\n    *****%/*//                     ////%*******\n    ****#**##%                     (((*****%,,,\n    **,*(%((((                     ////%***%,,,\n    ******/##%                     ###*********\n    *****%((((                     /(((#*******\n    ****//%##%                     ###(***%****\n    //**#(%%%%                     %%%%*%******\n    *****####%                     ###%*/******\n    //////###%                     ###%////////\n\n", 
    "features": 
    {
      "gates" : "The gates themselves are made from dry, pale wood clearly worn from the weather. Rough wrought iron hinges and clasps are used to support the wooden gates. On either side of the gates are sandstone pillars filled with intricrate patterned carvings of native animals.", 
      "wall" : "The walls of the city are made of several layers of sandstone brick, held together with concrete and mortar. There is a painted pattern running along the top of the wall, deep reds and blues showing different symbols like a sword, a moon, a flower, and a wand.",
      "guard" : "The guard looks like he's almost asleep. He leans against one of the pillars, resting, though he takes notice of you as you approach. "
    }, 
    "npcs" : ["city_gate_guard"], 
    "enemies" : [],
    "items": []
  },
  "city_road_1":
  {
    "name": "city road 1",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "secret_passage",
    "east": "city_road_2",
    "south": null,
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The city road winds westward through a dense residential area. Several clothes lines hang between buildings, and a cat sits perched on a windowsill to your left. Children play around outside in the street, running along the palace walls. Outside the palace walls a few fountains shaped like fish heads dispense water out into the trough that carries water around the city.",
    "short_description": "The city road winds through a residential area, clothes lines hanging overhead. Children play in the street and the palace walls dispense water into the city water troughs from fountains shaped like fish heads.",
    "forgotten_description": "The city road winds westward through an eerily familiar residential area. Several clothes lines hang between buildings, and a cat sits perched on a windowsill overhead. Children play around outside in the street, running along the palace walls. Outside the palace walls a few fountains shaped like fish heads dispense water out into the trough that carries water around the city.",
    "ascii_art" : "\n                         @@@%@@@@@@&\n                    @@@@/    &@       .@@@\n               .@@/          &@            @@\n             @@              &@               @@\n           @@                &@                 @&\n          @@                 &@.                 @@\n         @&              @@@@@@@@@@%              @@\n         @@@@@@@@@@@@@@@@@@@%@@@@@@@@@@@@@@@@@@%@@@@\n         @                    @                    @\n         @                    @                    @\n         @                    @                    @\n         @                    @                    @\n         @                    @                    @\n         @                    @                    @\n         @                    @                    @\n         @                    @      @      @      @\n         @                    %      @@@@@@@@      @\n         @                    @      @@@@@@@@.     @\n         @                    @       @@@@@@       @\n         @                    @      @@@@@@@@      @\n         @                    @     &@@@@@@@@@     @\n         @                    @    @@@@@@@@@@@@    @\n         @                    @    @@@@@@@@@@@@    @\n         @                    @  @@@@@@@@@@@@@@    @\n         @@@@@@@@@@@@@@@@@@@%@@@@@@@@@@@@@@@@@@%@@%@\n\n", 
    "features": 
    {
      "clotheslines" :"The clothesline overhead hangs between two buildings, holding up a few yellow and blue shirts, a red dress, a pair of pants, and a single white sock.", 
      "wall_fountain" : "The fountain is shaped like the head of a carp, scales carved with care. Years of sediment have built up in the mouth of the fish. Behind the water is a deep shadow.", 
      "shadow" : "The shadow leads to a small opening in the palace walls. It looks like you could fit if you crouched.", 
      "cat" : "You approach the cat, and it hisses at you, swatting at your face. "
    }, 
    "npcs" : [], 
    "enemies" : ["cat"],
    "items": []
  },
  "city_road_2":
  {
    "name": "city road 2",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "palace_walls",
    "east": "city_road_3",
    "south": "city_gates",
    "west": "city_road_1",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The gates lead through a portcullis into a town square. The buildings and road are hewn from clay and stone, with water trickling through a trough that spans the roof of each building. Ahead is a small public sitting area with pergolas to provide shade. Beyond that lies the palace walls. You can hear the hustle and bustle of the marketplace to the northeast. The road continues to the east and to the west under stone archways, crowned by carvings of animal heads. Ahead of you a friendly guide seems to be trying to get your attention. Your companion speaks to you as you stand in the square, \"My friend, I must run ahead to do some errands. Please take your time, explore the city, but meet me at the great hall of the castle. If you have any questions, talk to the city guide, I'm sure she can help you.\" He tells you, and waves as he jogs ahead. ",
    "short_description": "The road comes to a town square in the center of the village. To the north is a sitting area under a shaded pergola, beyond that lies the city walls. To the northeast you can hear the marketplace. A friendly guide stands nearby offering trivia and directions to passersby. ",
    "forgotten_description": "The gates lead through a portcullis into a town square. The buildings and road are hewn from clay and stone, with water trickling through a trough that spans the roof of each building. Ahead is a small public sitting area with pergolas to provide shade. Beyond that lies the palace walls. The sound of the hustle and bustle of the marketplace is drowned out in your mind, as you feel a strong draw to the palace.",
    "ascii_art" : "\n      &(   &,    &    &&    &&   &(&/#\n    ,,,@&,,,,,,,,,,,,,,,,,,,,,.,,&,,,&((( &&\n       /& ,&      ,(  ,&       ,&&,(,   &,&\n       ,&         ,/(            .,&   &,,\n       (&         ,(             ,,&    &,&\n       ,&         ,(             &,&    &,&\n       ,&%        ,(             &,&    &,&\n       ,&&        ,(             ,,#    &,&\n       ,&         ,(    ,,,,,,,,,,,%,(  &(&\n       ,&         ,(,,((,,,,,,,,,,.&((( &&&\n       ,#         ,( ,#,,,,,,,.,,,(&/(( &&&\n       .&@                       ,,&    &&   &*&\n   ,.&#&&                           &&*    &\n             &&  (&\n       &,& ,,,\n &   (,..\n\n", 
    "features": 
    {
      "water trough" : "The water trough is carefully crafted from baked clay. Gravity is used to propel the water to each building, with the trough dropping a few inches over several feet. Individual spouts spill water into copper basins by each home. Colorful designs of greenery and flowers are painted along the rim of the trough.", 
      "pergola" : "The wooden pergolas feature hardy vines growing on them, with small yellow and red flowers just beginning to bloom thanks to the water provided by the water troughs overhead. These vines offer plenty of shade for the benches below.", 
      "benches" : "There are several benches and tables hewn from desert wood under the pergolas. A gentle breeze passes through, and the shade makes the desert heat tolerable.", 
      "east arch" : "The eastern arch leads towards the marketplace and is constructed from the same material as the city walls. Crowning the arch is a carving of an eagle head.", 
      "west arch" : "The western arch leads to a residential sector and is constructed from the same material as the city walls. Crowning the arch is a carving of a mountain lion's head." 
    }, 
    "npcs" : ["city_guide"], 
    "enemies" : [],
    "items": []
  },
  "city_road_3":
  {
    "name": "city road 3",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "marketplace",
    "east": null,
    "south": null,
    "west": "city_road_2",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The cobbled road winds eastward towards the bustling city market. You can hear music and chatter fill the air as you walk along the road. A few small shops line the walkway, and city folk bustle back and forth, running errands. A small boy rattles a can asking for change. ",
    "short_description": "The cobbled road heads eastward towards the marketplace. There is a small boy rattling a can asking for change. ",
    "forgotten_description": "The cobbled road winds eastward towards the bustling city market. You can hear music and chatter fill the air as you walk along the road. A few small shops line the walkway, and city folk bustle back and forth, running errands. Over all of the music and talking, you can hear something, like your name is being called.",
    "ascii_art" : "\n                @////////////////////////////@\n                @////@@//@//(////@//@/@@@////@\n                @////##//#///%%//%//@(&@@////@\n                    @ @                 @\n             @   @/(/(@   @//(/    @*(//@   @(//@\n            @   %////@    @///*    ,////@    @///&\n           /    (////.    /(//*     /////     /////\n            @ @@,@/@@,@ @@*@/@&/@ @&(@*@##@ @#%@/@/\n             @..**************/*/*............,,&\n             @..************@*@*/@............,,&\n             @..**@*********(***/@...@       @,,&\n             @..*@*************//@...@       @,,&\n             @../////////////////@...@ .     @,,&\n             @.......................@       @,,&\n             @..,,,,,,,,,,,,,,,,,,,,,@       @,,&\n\n", 
    "features": 
    {
      "music" : "The music is a peppy guitar tune, coming from a busker standing on the edge of the street with his guitar case open for tips. ", 
      "shops" : "There are several different stores selling all kinds of home goods, like furniture, rugs, and garden accessories. "
    }, 
    "npcs" : ["little_boy"], 
    "enemies" : [],
    "items": []
  },
  "palace_walls":
  {
    "name": "palace walls",
    "song" : "fugue_paths_and_roads.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": null,
    "south": "city_road_2",
    "west": "marketplace",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The palace walls loom high overhead. The sandstone walls are double-thick, with guard towers spaced every twenty feet or so. There appears to be a walkway along the topside, where red-robed figures transport goods for the royal palace and keep watch on civilians below.",
    "short_description": "The palace walls are guarded, with guards patrolling between guard towers spaced every twenty feet or so.",
    "forgotten_description": "The palace walls loom over you, blocking your view of the royal palace. The guards above your head stare at you from the towers spaced every twenty feet or so. It feels like they know something you don't.",
    "ascii_art" : "\n                         *\n                        #####                         #####\n                         *\n                    //////(((((                  //////((((((\n//////((((/         //////(((//*  ***  ***  **   //////(((///         /////(((((\n//////(((//         //#///((((((**#**(**/**/**#**///#//((((((         /////(((//\n///#//(((((.  ..  .,////////(((***/****(((*******////////((((..  ..  .//#//(((((\n////////((((((((((((//////(((((*****(*******(****//////(((((((((((((((///////(((\n///***(((((*********//////(((((*****/***#***/****//////((((((*********///**(((((\n//////((#((****#****//////((#/(**#**/*******/**#*//////(((#((****#****/////((#/(\n//////(((((****#****//////(((((**#**/****//*/**#*//////((((((****(****/////(((((\n/////////((**//*****//////((///*****/*#####*/****//////(((//(*********/////(//((\n/**///((/((************///(((((*****/#######/****/**///((((((***********///(((((\n///#//(((((*********//#///(((((*****/#######/****///#//((((((*********//#//(((((\n//////(((((*********//////(((((*****/#######/****//////((((((*********/////(((((\n\n", 
    "features": 
    {
      "guard tower" : "The guard towers are covered, with small portholes allowing the guards an outward view. On either side of the towards are mounted heavy crossbows.", 
      "red robed figures" : "The red robed figures seem to be guards, but they each carry a long staff instead of a sword. It is hard to make out much more detail from this distance, though."
    }, 
    "npcs" : ["wizard"], 
    "enemies" : [],
    "items": []
  },
  "marketplace":
  {
    "name": "marketplace",
    "song" : "shopkeepers_tune.mp3", 
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": null,
    "south": "city_road_3",
    "west": "palace_walls",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The marketplace is cramped and crowded, filled with stall after stall of goods being sold by local and traveler alike. Exotic meats, rare fruit, gemstones and jewelry, fine cloth, spices, herbal medicines, tinctures, and even armor and weapons can be found in the market. As you walk through the aisles, an old woman in a lonely corner stall stares at you with a single gray eye.",
    "short_description": "The marketplace is cramped and crowded. All manner of goods can be found, from food and clothing to armor and weapons. An old woman watches you from a corner stall with her single gray eye. She smiles at you.",
    "forgotten_description": "The marketplace is cramped and crowded, filled with stall after stall of goods being sold by local and traveler alike. Exotic meats, rare fruit, gemstones and jewelry, fine cloth, spices, herbal medicines, tinctures, and even armor and weapons can be found in the market. As you walk through the aisles, an old woman in a lonely corner stall stares at you with a single gray eye. She frowns and shakes her head, beckoning you over.",
    "ascii_art" : "\n.,,*,,,,,,/,,,,,,,*/********/*/*////////#/(/(((((#((((((((#(##(##(###\n    .      . .        .        *  .      . ,      . *      . ,    . .\n    .        .        .        .       .                   *      . *\n  . .      . .        .                         .        . ,      . /\n  , .          /        . . (    . , .    * . .        /   .      , #\n  . .          / , *          .         .          / . *          . *\n   .                . .        . / .          . .            . . . .\n . , . . . .                                             . . . ,   .\n . . . .     . .   . . . / ,             . . .   .                 .\n ,   .          .       .    .         .  . (   .   #   , . .      .\n .      . . /          *    .           .  . %              / .    .\n .    .      . . * .       .            .   . /        , . .    .  .\n .       .      ,      ,   /             &     . .      ,    (     .\n .  .  *  *         .                       .     ,    ,    .  .  ..\n .   .     .  ,        ..                       . ./ .  ,  /  /  ...\n      /.  ** /  ,.                            .          %  #  *., .\n ..      %   /   .  ,                           /.   ..  .   .     .\n  .     (,   . .                                       .     #(*#. .\n .. * .  .   , ,.                                    .   . ..,/.,  .\n    ,   .    .       .----..-. .-. .----. .----.         .     . .,.\n . *,, .. .         { {__  | {_} |/  {}  `| {}  }          . ,, ../,\n  #,,, .            .-._} }| { } |`      /| .--'              .*..#.\n %*.                `----' `-' `-' `----' `-'                     *#\n %                                                                 /\n /                                                                */\n (*                                                               /*\n ,%                                                               (#\n\n", 
    "features": 
    {
      "corner stall" : "The corner stall is colorful and stuffed to the brim with oddities and knick knacks. There are beaded curtains covering the entrance way, with a sign that says \"SHOP\". As you approach you can smell cinnamon. ", 
      "corner shop" : "The corner stall is colorful and stuffed to the brim with oddities and knick knacks. There are beaded curtains covering the entrance way, with a sign that says \"SHOP\". As you approach you can smell cinnamon. "
    }, 
    "npcs" : ["merchant"], 
    "enemies" : [],
    "items": []
  },
  "secret_passage":
  {
    "name": "secret passage",
    "song" : "fugue_throne_room.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "gardens",
    "east": null,
    "south": "city_road_1",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The small hole is a tight fit, but you manage to crouch enough to not hit your head. It is dark, seeming to stretch deep into the palace walls. There is a thick dampness in the air, small drips dropping from the plumbing system that is housed inside the walls. The walls of the passage are textured, the sandstone clearly scratched away by some metal tool like a pickaxe.",
    "short_description": "The passage is small, dark, and damp. The rough walls lead through to the otherside of the palace walls.",
    "forgotten_description": "The small hole is a tight fit, but you manage to crouch enough to not hit your head. It is dark, seeming to stretch deep into the palace walls. There is a thick dampness in the air, small drips dropping from the plumbing system that is housed inside the walls. The walls of the passage are textured, the sandstone clearly scratched away by some metal tool like a pickaxe. The textures give way to patterned dots. A-S-H-I-R-A.",
    "ascii_art" : "\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n@@@@@@@@@@@@@@@@@@@@@@@@@@@        @@@@@@@@@@@@@@@@@@@@@@@@@\n@@@@@@@@@   @@     @      @       @      @      @   @@@@@@@@\n@@@@@@@@      @      @@@@ .@@&%@@@@ @@@ @     @      @@@@@@@\n@@@@@@@         @(@       /@@@@@@@@       @@@#         @@@@@\n@@@@@  @@      @     @@@@@@@@@@@@@@@@@@@(    @%      @@ @@@@\n@@@@       @&@    @@@@@@@@@@@@@@@@@@@@@@@@@    @(@@      @@@\n@@         @,   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @         @\n@@ @@@@   @    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @   @@@@ *\n@@        @   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @,       *\n@@       ,@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@\n@@       @@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @/  .@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @.  /@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @   #@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@\n@@       @   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n@@       @   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @       *\n\n", 
    "features": 
    {
      "walls" : "The walls are scratched up roughly. There seems to be something written, scratched into the sandstone.", 
      "writing" : "You can barely make out the words: YOU'VE BEEN HERE BEFORE."
    }, 
    "npcs" : [], 
    "enemies" : [],
    "items": []
  },
  "gardens":
  {
    "name": "gardens",
    "song" : "fugue_throne_room.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": "tower",
    "south": "secret_passage",
    "west": "well",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The light is bright as soon as you emerge from the passage, and suddenly you are surrounded by lush greenery. Long trailing vines of red-tipped green leaves dangle on either side of you, shrubs and flowers in front of you. The lawn spawns for dozens of yards, and a grand three-tiered fountain sits at the center of it. To the east is a tower taller than the palace walls, and to the west there is a large, covered well. Birds fly overhead, singing and chirping. A beatiful siamese cat chases the birds playfully before stopping to look at you.",
    "short_description": "The gardens are massive and lucious. In the center of the lawn sits a 3-tiered grand fountain, to the east stands a tall tower, and to the west is a large well. To the south, through the veil of vinery, a secret passage to the outside city is hiddin in the palace walls. The birds sing and chirp from the trees and bushes. The pretty siamese comes up to meow at you for attention.",
    "forgotten_description": "The light is bright as soon as you emerge from the passage, and suddenly you are surrounded by lush greenery. Long trailing vines of red-tipped green leaves dangle on either side of you, shrubs and flowers in front of you. The lawn spawns for dozens of yards, and a grand three-tiered fountain sits at the center of it. To the east is a tower taller than the palace walls, and to the west there is a large, covered well. Birds fly overhead, singing and chirping. These gardens feel like home. Your cat comes and rubs against your legs.",
    "ascii_art" : "\n                        ..,,,,,,,....\n                       ,..   ,,,    ..\n                       ,.    .,.    ..\n                       ..    #%%    ..\n            ///////////**////#%%###(//(###(/////  *\n         *,,,,,..     .,,,,*/////////*   ...,,,,,,*.\n          .,*,, ,(######((((((((((((((((((#*,*,*,...\n          .,,,,,/..,, ../, ..,*.,,(*,**(**/***,,,...\n          .,,,,   (,(,,,(,,,,,*,**#***/*/# ,,,,,,...\n          .,,,,            /(((((((        ,,,,,,...\n          ..,,,              ((((((,#     .,,,,,,..\n          ..,,,              ..,,,*///    .,,,,,,..\n          ..,,, *,           ..,,,*******,,**,,,,..\n       ///**,,,/*//////////,,**#((%%%%%%%%%********///\n            ,,,,,,,,,,,,,,, ..,*//%##///(((*****#     *///\n      #*,///. .. .................,,,,,,,,,,,***/###((.\n       #... /,, *,,,**,,,,**,,***//****//(*/.,(/,*/*(\n         #*,,/.../, ..,,,  .,,*,.,,***,******/#///%\n             #***,/,,,,(,,,,,,*,,**#*****(/(((%\n                        .*//((##((((\n                        . ,*******/#\n                         %#/.,,,/((\n                         ,/./..,.*,,\n                     ( * *,.,..*.,*,/,#\n               / *      ...,...*,,,,.,,,, **/\n              *..          ..........,,,,**//#\n              *...............,,,,,,,******///\n                   ((/........,,,,,,,*(##\n\n", 
    "features": 
    {
      "fountain" : "The fountain is lavish, a three-tiered marble sculpture with cherubs pouring water out of basins down into a pool below. In the pool swim several koi fish.",
      "koi fish" : "There are three koi fish. Each has unique orange and black markings on top of pearly white scales."
    }, 
    "npcs" : [], 
    "enemies" : [],
    "items": []
  },
  "well":
  {
    "name": "well",
    "song" : "fugue_throne_room.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": "gardens",
    "south": null,
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The well is large, round, and deep, carefully constructed from riverstone and copper, expensive imported materials. Overhead an awning crafted from fine hardwoods and thatch roofing protects the well from the sweltering glare of the sun. From the basin of the well several copper pipes run up and out of the gardens, over the palace walls. The pipes are disguised by hedges and flowering vines.",
    "short_description": "The well is large, round, and deep. It rests under an awning made from imported hardwoods and thatched roofing, which protects the well from the sun. The well feeds the water throughout the whole city.",
    "forgotten_description": "The well digs deep under the city to source water from an ancient spring that has sustained the city for many years. The aged awning with the thatched roof protects the well from the harsh sunlight. You remember.",
    "ascii_art" : "\n            /@,#&\n         *%..,,,,***/&\n      *%,,..,,,,,*******@\n    &,,,....,,,,,********,&\n  (,,,,....,,,,,,*********,,@\n%&&&%%%%%%&&&&&&&&&&&&&&&&&&&&@\n    @@                   ##\n    @@    * * * * / /    ##\n    @@  @/&@&@&&%&%%#%%  ##@/\n    @@%%@(&@&@&&%&%&#%#%%@#(@###(\n    @@   # @ @ @ @ @#@*  ##    #(\n    @@              #(   ##    #%@%%%&,\n   ,@@,,,,,,,,,,,,,,%#,,,%%,,\n  ((##((/*///(&&&@&&&@&##&&&@\n   /////*/*///(%((((&####((@\n   /*//****///((((((##%##((@\n   /*//*#**///((((((&#####(@\n   /*/#***////((((((#####((@\n   /*//*#**//#((((((&#####(@\n   /*//****///((((((##%##((@\n   /*//*#**//#((((((#####((@\n(/(******////((((((##########(@\n\n", 
    "features": 
    {
      "basin" : "The basin is constructed carefully from copper. There seems to be a mechanical pump that pushes the water through to the city.",
      "vines" : "The vines are long and green, with tiny heart-shaped leaves. Little white flowers with five petals sprout from nodes on the vine", 
      "pipes" : "The pipes are old, but well maintained. They are crafted from copper, and are around three inches in diameter. ", 
      "well" : "The well itself is very deep, looking down it leads to a pitch black hole. "
    },
    "npcs" : [], 
    "enemies" : [],
    "items": []
  },
  "tower":
  {
    "name": "tower",
    "song" : "fugue_tower_bedroom.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "great_hall",
    "east": "bedroom",
    "south": null,
    "west": "gardens",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The tower pierces the sky, the outside walls following a stair-step spiralling pattern, twisting upwards. Every ten verticle feet or so there is a window. Inside there is a lavish sitting area on the first floor, with a warm fireplace just in front of the spiral staircase. There seems to be something hiding under the staircase. ",
    "short_description": "The tower is tall and ornate. Inside there is a lavish sitting area complete with warm fireplace right in front of the spiral staircase. There seems to be something hiding under the staircase. ",
    "forgotten_description": "The tower welcomes you back, the warm fire inside sounds the same. Your chair sits by the fire just close enough to keep you warm on a cold desert night, but not so close as to scald you during the day. The spiral stairscase leads upstairs.",
    "ascii_art" : "\n ..%@@@@@..  @@@@@/  .@@@@@@ .. @@@@@@. \n.  @       ..@    /.. @    @.  .     @ .\n.  @           &    @    *           @ .\n.  @           %    @    ,           @ .\n.  ..@@. *@  @/  @  @@  @  @@  @  @@.  .\n ..  ..  @  @@  @  #@  @, ,@  @# ..  .. \n ..  ..        &    @    *       ..  .. \n ..  ..      .  @       @  #     ..  .. \n ..  ..@         @@@@@@@         (.  .. \n.  ..  @@@@@@@@   @@@@@   @@@@@@@@ ..  .\n.  ..        ,    @@@@@    %       ..  .\n.  ..                              ..  .\n.  .. (             @              ..  .\n   ///////////////////////////////////  \n ..                                   . \n ..                 @                 . \n ..                 @                 . \n .. .    #@@@@@@.         (@@@@@@/  @.. \n.  ..                               .  .\n.  ..&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.  .\n.  .@      @@@@     @     @@@@      *  .\n.  .@      @@@@           @@@@      @  .\n ..          @      @      @         .. \n ..                                  .. \n ..@                                 &. \n ..@         @ @  @   @  @ @       ( @. \n            @  @   @@@   @  @           \n.          @@  @@@@@@@@@@(  &@         .\n@     @        @@@@@@@@@@@        @     \n@       @      @@@@@@@@@@@      @       \n@       @      @@@@@@@@@@@      @       \n@    .         @@@@@@@@@@@         #    \n@       @      @@@@@@@@@@@      @       \n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n@    .         @@@@@@@@@@@         #    \n\n", 
    "features": 
    {
      "fireplace" : "The fireplace is warm, made of red brick, and burning several charred logs.", 
      "staircase" : "You peer behind the staircase. It's dark, and there are a lot of cobwebs back there. Suddenly, a large spider jumps out at you! ", 
      "window" : "Looking out the window, you can see the city, all the way to the gate. A few people are milling about. It appears the sun is starting to set. "
    }, 
    "npcs" : ["giant_spider"], 
    "enemies" : [],
    "items": []
  },
  "bedroom":
  {
    "name": "bedroom",
    "song" : "fugue_tower_bedroom.mp3",
    "is_start": false,
    "is_current_location": false,
    "mirror_uncovered" : false, 
    "north": null,
    "east": "tower",
    "south": null,
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The bedroom is larger than one would expect, clean and airy. The four poster bed has a canopy to protect its occupant from the harsh desert sun, and several tables and chairs are scattered around the space. In one corner of the room is a writing desk with a diary on it, and to the side of it sits a large trunk. On the other side of the room there is a large mirror. ",
    "short_description": "The bedroom is large, with a four poster bed and a writing desk. Downstairs is the rest of the tower. In one of the corners of the room there is a large mirror.",
    "forgotten_description": "Your bedroom is just as it should be, though the mirror is covered in cloth. ",
    "ascii_art" : "\n     _   ()\n() .'_`'.||\n||/.| ||` |\n| /|| || ||         _   ()\n|| || || ||    () .'_`'.||\n|| || || ||    ||/.| ||` |\n|| || ||-'`-._ | /|| || ||\n||_|'`_.-||-._`'| || || ||\n|._ <'_  ||   `|| || || ||\n|| `-._`-'|    || || |'-'|\n()     `-._`-._||_''`_.-||\n           `-._` _.-'   ()\n               ||       `\n               ()\n               `\n\n", 
    "features": 
    {
      "bed" : "The four poster bed is made from a rich, dark wood. From the posters hangs a canopy made of red and white silk, lined in gold. There is a divot in the pillow on the right side of the bed, and to the right of the bed is a small bedside table made from matching wood. ", 
      "bedside table" : "The small bedside table is made from the same wood as the bed. The table is small, with a single drawer in the front.",
      "drawer" : "Inside the drawer are several little baubles and trinkets. Lip balm, ribbon, a few loose buttons, but what stands out most is a single tattered photo.", 
      "desk" : "The desk is still set up with all manner of writing materials. A quill and an ink pot sit out, along with a damaged diary. ", 
      "diary" : "The diary is bound in red leather, with a signet emblazoned on the cover. Flipping through reveals a lifetime of memories. But there are pages torn out. You recognize the handwriting. ", 
      "trunk" : "The trunk is constructed from high quality materials, oak and buffalo leather, and a sturdy lock made from steel. The trunk is locked. ", 
      "mirror" :"The mirror is tall and ornate, gilded gold scrolls holding gently onto the fogged surface. It's odd, wiping the surface doesn't seem to remove the fog. Suddenly, a figure appears. "
    }, 
    "npcs" : ["person_in_the_mirror"], 
    "enemies" : [],
    "items": ["Tattered Photo"]
  },
  "great_hall":
  {
    "name": "great hall",
    "song" : "fugue_throne_room.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": "throne_room",
    "east": "dining_hall",
    "south": "tower",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The great hall has a vaulted ceiling, allowing cool air to flow through, and the hot air to rise away from the occupants. The floor is polished and checkered, fit for a ball, and leading past rows of armor suits mounted and displayed inside niches carved into the walls. There is a doorway to the east and an even larger double doorway straight ahead. By the armor there is a spectral figure, the ghost of a soldier. ",
    "short_description": "The great hall is fit for a ball, with its high ceilings and polished floor. To the east there is a doorway to the dining hall, and to the north is an even larger doorway to the throne room. The ghost of a soldier floats near the armor. ",
    "forgotten_description": "The great hall is empty, but has been kept in good shape. The suits of armor have been recently polished. To the east there is a doorway that is dwarfed in comparison to the large double doorway ahead.",
    "ascii_art" : "\n  ,   A           {}\n / `, | ,        .--.\n|    =|= >      /.--.`\n ` /` | `       |====|\n  `   |         |`::`|\n      |     .-;``..../`;_.-^-._\n     /\\/  /  |...::..|`   :   `|\n     |:'` |   /'''::''|   .:.   |\n      ` /`;-,/`   ::  |..:::::..|\n      |` <` >  >._::_.| ':::::' |\n      | `'''`  /   ^^  |   ':'   |\n      |       |       `    :    /\n      |       |        `   :   / \n      |       |___/`___|`-.:.-`\n      |        `_ || _/    `\n      |        <_ >< _>\n      |        |  ||  |\n      |        |  ||  |\n      |       _`.:||:./_\n      |      /____/`____`\n\n", 
    "features": 
    {
      "armor" : "The armor is polished and made of thin metal, standing with its arms crossed, resting on a long sword. The breastplate bears the crest of the royal family.", 
      "small door" : "The small door is simple and wooden, suspended by wrought iron hinges. From it flows sweet smells of fruit, cheeses, meat, and breads.", 
      "large door" : "The large doudle doors are grand, with inscriptions carved into them, hung carefully from animal-shaped hinges made of wrought iron plated in gold."
    }, 
    "npcs" : ["soldier_ghost"], 
    "enemies" : [],
    "items": ["Royal Staff"]
  },
  "throne_room":
  {
    "name": "throne room",
    "song" : "fugue_combat.mp3",
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": null,
    "south": "great_hall",
    "west": null,
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The throne room you enter is long and ominous. Black drapery hangs over the windows, obscuring the sun, and several advisors turn to look at you as you enter. The throne itself is atop a platform, with several rows of stairs leading up to it. Torches light the room, held from brass and amber sconces. It looks like someone is sitting on the throne. ",
    "short_description": "The throne room is long and dark. Black drapery hangs over the windows, blocking out the sun. The throne sits atop a platform with several stairs leading up to it. The room is lit by torches in brass and amber sconces. Someone is sitting on the throne. ",
    "forgotten_description": "The throne room does not welcome you as it once did. Black drapery blocks the windows, torches dimly lighting the room are hung from brass and amber sconces. The throne is occupied, sitting at a platform with several stairs leading up to it.",
    "ascii_art" : "\n                              .@  #*(  @\n                             @&*%     &*&&\n                           %&,(/       *(,@&\n                     /,&(    . .(,/%(,(. .    (%,(\n                      /@%&%      #%.&%      %&%@*\n                      &# %*&@&(%#&%(///&(&@@*% #%.\n                       .(%(&..&##     #/&.,@*&(.\n                       *%*/(&%           /%/(,%*\n                      (% #%%.%           #,&## %#\n                       @,(#*&&           #&,%#.@\n                       ,#*/%%%           ##@*/(,\n                      .*#&,%%&           ##&,&#*.\n                      /@&&,&%&           ##@,@@@(.\n                  @%%#@@,,/@%&           &%@/.*%@&&#&\n                 &#%%#*@.%&@%@&%%%%&%%&&&%%@&&.@*&&##%\n                @&&%%&*@                       @*&%#&&@\n              &&###%%% (&                    ( %&%##%%&\n               @%%%@&%%%%&                    #%%%%@%%&@\n               &/,**%%%%%%#                  %##%%&(*,/%\n               &(,,((%%%%&###              #&%%%#&##*/,&\n                %@& &&%%%&%%#%%###%%###%%%%%&&%#%&%*&&#\n                .&%#&%%%%&%%%&&%%%%&%%%%&%%%&&%%%&&#&%.\n                ./*/&%%%&&&@&@@@@@@@@@@@@&&&@&&%%%%//.\n                 /.%                               &*.\n                 /.,                               ./\n                #,/#                               #.,#\n\n", 
    "features":
    {
      "drapery" : "The black drapery is trimmed with gold and red, tassels hanging from the edge. The fabric looks to be linen, blocking out the worst of the sun and casting a shadow across the throne room.", 
      "throne" : "The throne sits atop a pedestal, led up to by sandstone stairs. The throne itself is massive, with animal heads carved into the arms and legs. Red velvet cushions upholster the throne. In it sits your earlier companion, Proteus.", 
      "torches" :"Wooden torches wicked in tar burn brightly, flickering and sparking embers off onto the floor below. There are two in each copper sconce, crossed in the middle to for an X-shape."
    }, 
    "npcs" : ["Impostor"], 
    "enemies" : ["Impostor"],
    "items": ["King's Crown"]
  },
  "dining_hall":
  {
    "name": "dining hall",
    "song" : "fugue_tower_bedroom.mp3", 
    "is_start": false,
    "is_current_location": false,
    "north": null,
    "east": null,
    "south": null,
    "west": "great_hall",
    "times_visited": 0,
    "was_forgotten": false,
    "long_description": "The dining hall is surprisingly empty, considering the amount of food and drink generously sprawled out across the table. The table is long, spanning almost the length of the whole room, and looks like it could seat upwards of 20 people. There are three silver candelabras on the table, candles burning a low light that reflects off of the metal and porcelain plates. A large painting hangs on the wall depicting a far away forested place. Next to it is a door that must lead to the kitchen, but it is blocked. In front of the door sits a rat, squeaking and chewing on a piece of toast. ",
    "short_description": "The dining hall is still empty. The table spans the whole room, covered in an array of food and drink. On the wall, there is a large painting depicting a far away forested place. In front of the back door sits a rat chewing on a piece of toast. ",
    "forgotten_description": "The dining hall is not bustling like it once was, though the table is set with a lavish spread. The table is long, spanning almost the length of the whole room, and looks like it could seat upwards of 20 people. There are three silver candelabras on the table, candles burning a low light that reflects off of the metal and porcelain plates. A large painting hangs on the wall depicting a far away forested place. Next to it is a door that must lead to the kitchen, but it is blocked.",
    "ascii_art" : "\n                          (             )\n                  )      (*)           (*)      (\n                 (*)      |             |      (*)\n                  |      |~|           |~|      |\n                 |~|     | |           | |     |~|\n                 | |     | |           | |     | |\n                ,| |a@@@@| |@@@@@@@@@@@| |@@@@a| |.\n           .,a@@@| |@@@@@| |@@@@@@@@@@@| |@@@@@| |@@@@a,.\n         ,a@@@@@@| |@@@@@@@@@@@@.@@@@@@@@@@@@@@| |@@@@@@@a,\n        a@@@@@@@@@@@@@@@@@@@@@' . `@@@@@@@@@@@@@@@@@@@@@@@@a\n        ;`@@@@@@@@@@@@@@@@@@'   .   `@@@@@@@@@@@@@@@@@@@@@';\n        ;@@@`@@@@@@@@@@@@@'     .     `@@@@@@@@@@@@@@@@'@@@;\n        ;@@@;,.aaaaaaaaaa       .       aaaaa,,aaaaaaa,;@@@;\n        ;;@;;;;@@@@@@@@;@      @.@      ;@@@;;;@@@@@@;;;;@@;\n        ;;;;;;;@@@@;@@;;@    @@ . @@    ;;@;;;;@@;@@@;;;;;;;\n        ;;;;;;;;@@;;;;;;;  @@   .   @@  ;;;;;;;;;;;@@;;;;@;;\n        ;;;;;;;;;;;;;;;;;@@     .     @@;;;;;;;;;;;;;;;;@@a;\n    ,%%%;;;;;;;;@;;;;;;;;       .       ;;;;;;;;;;;;;;;;@@;;%%%,\n .%%%%%%;;;;;;;a@;;;;;;;;     ,%%%,     ;;;;;;;;;;;;;;;;;;;;%%%%%%,\n.%%%%%%%;;;;;;;@@;;;;;;;;   ,%%%%%%%,   ;;;;;;;;;;;;;;;;;;;;%%%%%%%,\n%%%%%%%%`;;;;;;;;;;;;;;;;  %%%%%%%%%%%  ;;;;;;;;;;;;;;;;;;;'%%%%%%%%\n%%%%%%%%%%%%`;;;;;;;;;;;;,%%%%%%%%%%%%%,;;;;;;;;;;;;;;;'%%%%%%%%%%%%\n`%%%%%%%%%%%%%%%%%,,,,,,,%%%%%%%%%%%%%%%,,,,,,,%%%%%%%%%%%%%%%%%%%%'\n  `%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'\n      `%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'\n             \"\"\"\"\"\"\"\"\"\"\"\"\"\"`,,,,,,,,,'\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n                            `%%%%%%%'\n                             `%%%%%'\n                               %%%\n                              %%%%%\n                           .,%%%%%%%,.\n                      ,%%%%%%%%%%%%%%%%%%%,\n          ---------------------------------------------\n", 
    "features":
    {
      "candelabra" : "Each silver candelabra holds 5 tall, white candles. Each burns dimly, dripping wax down onto a porcelain dish below each candelabra. They are simple, but elegantly designed.", 
      "food" :"Sprawled across the table are generous helpings of wine and mead, pitchers of ice water for drink. There are roasts of ham and beef, entire pheasants that have been basted and grilled, served alongside carrots and beets and rolls with butter. There is a green salad, tossed with goat cheese. The spread is entirely untouched, aside from a large chocolate cake which has one slice cut.",
      "cake" : "The chocolate cake is rich and decadent, and the candles on the cake are still lit, wax melting onto the icing. A single slice is served at the head of the table.", 
      "painting" :"The painting is a fine oil painting, depicting a forested mountainside. The sky is a light blue, depicting sunrise, glinting off of the river flowing through the valley."
    }, 
    "npcs" : [], 
    "enemies" : ["rat"],
    "items": []
  }
}
